CarRentWebApp/CarRentWebApp/Service References/RentCarServiceReference/RentCarWSDL.wsdl

<?xml version="1.0" encoding="utf-8"?>
<wsdl:definitions xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:ns="http://xml.netbeans.org/schema/CarRentalSchema" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://j2ee.netbeans.org/wsdl/CarRentalBPEL/src/RentCarWSDL" xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype" xmlns:ns0="http://rentcar.hub.com/" xmlns="http://schemas.xmlsoap.org/wsdl/" name="RentCarWSDL" targetNamespace="http://j2ee.netbeans.org/wsdl/CarRentalBPEL/src/RentCarWSDL" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/">
  <plnk:partnerLinkType name="RentCarWSDL">
    <!-- A partner link type is automatically generated when a new port type is added. Partner link types are used by BPEL processes. 
In a BPEL process, a partner link represents the interaction between the BPEL process and a partner service. Each partner link is associated with a partner link type.
A partner link type characterizes the conversational relationship between two services. The partner link type can have one or two roles.-->
    <plnk:role name="RentCarWSDLPortTypeRole" portType="tns:RentCarWSDLPortType" />
  </plnk:partnerLinkType>
  <wsdl:types>
    <xsd:schema targetNamespace="http://j2ee.netbeans.org/wsdl/CarRentalBPEL/src/RentCarWSDL">
      <xsd:import schemaLocation="http://Office-Depot:9080/CarRentalCA-sun-http-binding/CarRentalBPEL/CarRentalSchema.xsd" namespace="http://xml.netbeans.org/schema/CarRentalSchema" />
      <xsd:import schemaLocation="http://localhost:8080/HubService/HubService?xsd=1" namespace="http://rentcar.hub.com/" />
    </xsd:schema>
  </wsdl:types>
  <wsdl:message name="RentCarWSDLOperationResponse">
    <wsdl:part name="part1" type="ns0:addRegistryResponse" />
  </wsdl:message>
  <wsdl:message name="RentCarWSDLOperationRequest">
    <wsdl:part name="part1" type="ns:RentRequestComplexType" />
  </wsdl:message>
  <wsdl:portType name="RentCarWSDLPortType">
    <wsdl:operation name="RentCarWSDLOperation">
      <wsdl:input name="input1" message="tns:RentCarWSDLOperationRequest" />
      <wsdl:output name="output1" message="tns:RentCarWSDLOperationResponse" />
    </wsdl:operation>
  </wsdl:portType>
  <wsdl:binding name="RentCarWSDLBinding" type="tns:RentCarWSDLPortType">
    <soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="rpc" />
    <wsdl:operation name="RentCarWSDLOperation">
      <soap:operation soapAction="" />
      <wsdl:input name="input1">
        <soap:body use="literal" namespace="http://j2ee.netbeans.org/wsdl/CarRentalBPEL/src/RentCarWSDL" />
      </wsdl:input>
      <wsdl:output name="output1">
        <soap:body use="literal" namespace="http://j2ee.netbeans.org/wsdl/CarRentalBPEL/src/RentCarWSDL" />
      </wsdl:output>
    </wsdl:operation>
  </wsdl:binding>
  <wsdl:service name="RentCarWSDLService">
    <wsdl:port name="RentCarWSDLPort" binding="tns:RentCarWSDLBinding">
      <soap:address location="http://Office-Depot:9080/RentCarWSDLService/RentCarWSDLPort" />
    </wsdl:port>
  </wsdl:service>
</wsdl:definitions>