CarRentalCA/test/RentCarTestCase/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ren="http://j2ee.netbeans.org/wsdl/CarRentalBPEL/src/RentCarWSDL">
  <soapenv:Body>
    <ren:RentCarWSDLOperation>
      <part1>
        <rentalDate>10/12/2014</rentalDate>
        <returnDate>20/12/2014</returnDate>
        <idCar>1</idCar>
        <userId>4</userId>
        <providerId>kutz</providerId>
      </part1>
    </ren:RentCarWSDLOperation>
  </soapenv:Body>
</soapenv:Envelope>